baseCase_openspace_bctest/0/k.origin
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0; // The fluid is at stand still

boundaryField
{

  symmetric
    {
      type symmetry;
    }

  environment
    {
      type zeroGradient;
    }
  
  axis
    {
      type empty;
    }

  wedgePatch1
    {
      type wedge;
    }
	
  wedgePatch2
    {
      type wedge; 
    }
	
}


// ************************************************************************* //
